# Scale Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Outline..::..Scale Method
Outline Class See Also
---
Scales the bounding box by given scale.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void Scale(
	double scale
)
```

Visual Basic
---
```text
Public Sub Scale ( _
	scale As Double _
)
```

Visual C++
---
```text
public:
void Scale(
	double scale
)
```

# ### Parameters
scale
    Type: System..::..Double The scale value. It should be greater than zero.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The scale is invalid. |

# See Also
Outline Class
Autodesk.Revit.DB Namespace